In [ ]:
==================EDA====================================
pandas        :        Data frame operation 
numpy         :        math operation
matplotlib    : plotting or graphs
seaborn        :   plotting or graphs
plotly          : plotting or graphs
bokhe            : plotting or graphs
===================Machine learning=============================
sickit-learn    :for all Ml alogorithm
stats           : some statistical operations 
ml LIb          : for all Ml alogorithm  on py spARk
====================Deep learning =============================
tensorflow      : Deep learning models(google)
keras            : Deep learning model tensor flow  as backend
pytorch         : Deep learning models(meta)
open cv          :image and video operation
pillow          :image operation
=====================object detected model (transfer learning=====================
mobilenet         :DL packages
VGGnet            :DL packages
Ressnet            :DL packages
Inception v3       :DL packages
YoLO               :DL packages
====================Natrual language Process====================
NLTK             : Natrual langage Tool ki
spaCy            : Alternative to NLTK
Worldcloud       :Text Represtation
================NLP word Emmbedding Models=============
Word2Vec          :Google
gloVe             :Standford
Fasttext           : meta(face book)
==================ALLEN NLP(oraganization)===============
NLP application    :pyspark as Backend
==================Optical Character Recognition(OCR)======================
Extract the text from the image
Tesseract
easyocr
===================BERT=================================
BERT:bi diectional encoded Represntation from transformers
Transformers      :Hugging face
===================WebScrapping=========================
sqliteselenium
                                            beautiful saop
                                            Regex
=====================GenAI and LLM=========================
Lngchain     :to connect all LLm models
gpt:open ai
gemini :google
Llama  :Meta
grok:XAI
bedRock:Amazon
Claude AI :Anthropic
=====================agentic ai==================
langraph
                                            crewai
                                            phidata
                                            autogen
====================API Creation======================
flask
fastapi
Gradio
Django
====================WebApplication===================
streamlit
=====================mode;deployment(mlops)===========
mlflow:DataBricks ETL
kubeflow
=============cloudAI=================
Azure Cognirive Servise
AzureMlstudio
GCP vertexAI
AWS sagemaker
============
 random
 time
 math
 logging
 warnings
 date

In [4]:
import pandas as pd #dataframe operations
import numpy as np #math operations
import matplotlib.pyplot as plt # plotting
import seaborn as sns # plotting

In [6]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
pd.DataFrame(zip(names,age))

        0   1
0  ramesh  20
1  suresh  22
2  mahesh  24

**pd.DataFrame()**

- data =none
- index:index or array-like
- columns:index or array-like

In [12]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
pd.DataFrame(zip(names))# e=why we use zip because it contain different feature 1st ine name is data and age is index

        0
0  ramesh
1  suresh
2  mahesh

**step3 add the columns**

In [15]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
cols=['names','age']
pd.DataFrame(zip(names,age),columns=cols)

    names  age
0  ramesh   20
1  suresh   22
2  mahesh   24

In [17]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
cols=['names','age']
idx=['a','b','c']
pd.DataFrame(zip(names,age),index=idx,columns=cols)

    names  age
a  ramesh   20
b  suresh   22
c  mahesh   24

**step-4 change theindex**

In [20]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
cols=['names','age']
idx=['a','b','c']
pd.DataFrame(zip(names,age),index=idx,columns=cols)

    names  age
a  ramesh   20
b  suresh   22
c  mahesh   24

**step-5 Create empty dataframe and update the dataframe**

In [23]:
# above one we created dataframes with value directly
# now first we will create empty df
# then we will add the values
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [25]:
#f['names'] # if i run this if any column values available under names it will display other vise error
# it indicates either you are creting a new column ----
#or you are modify the column values

In [27]:
df['name']=['ramesh','suresh','mahesh']
df['age']=[20,22,24]
df

     name  age
0  ramesh   20
1  suresh   22
2  mahesh   24

In [29]:
df=pd.DataFrame()
df
df['name']=['ramesh','suresh','mahesh']
df['age']=[20,22,24]
df

     name  age
0  ramesh   20
1  suresh   22
2  mahesh   24

In [31]:
#my dataframe name: df
df['age']

0    20
1    22
2    24
Name: age, dtype: int64

In [33]:
# modify
df['age']=[30,22,54]
df

     name  age
0  ramesh   30
1  suresh   22
2  mahesh   54

In [35]:
df['age']=[30,22,54]#update
df
df['Age']=[30,22,54]# create
df
df['city']=['hyd','mum','delhi']#create
df

     name  age  Age   city
0  ramesh   30   30    hyd
1  suresh   22   22    mum
2  mahesh   54   54  delhi

**Notes**

- pytho is case sensitity
- agd and Age consider as different
- nUmber of rows always should be len dataframe
- Dont except null like sql if u miss any value

**step-6 Drop the Column**
- df.drop()
- labels: 'IndexLabel | None' = None, *,
- axis: 'Axis' = 0,
- index: 'IndexLabel | None' = None,
- columns: 'IndexLabel | None' = None,
- inplace:'bool'=false

In [39]:
# i want drop the age column
#what is the age colum
# what is the age column index
# 2 or [2] index row or column
#have u mention any roow or column 
# axis will define the row or column if o it is in roww if 1 it will go to column
print(df)
df.drop(2)

     name  age  Age   city
0  ramesh   30   30    hyd
1  suresh   22   22    mum
2  mahesh   54   54  delhi

     name  age  Age city
0  ramesh   30   30  hyd
1  suresh   22   22  mum

In [41]:
df.drop(2,axis=0)#index

     name  age  Age city
0  ramesh   30   30  hyd
1  suresh   22   22  mum

In [53]:
df.drop([1,2],axis=0)#index

     name  age  Age city
0  ramesh   30   30  hyd

In [55]:
df.drop('Age',axis=1)

     name  age   city
0  ramesh   30    hyd
1  suresh   22    mum
2  mahesh   54  delhi

In [57]:
df.drop(columns=['Age'])

     name  age   city
0  ramesh   30    hyd
1  suresh   22    mum
2  mahesh   54  delhi

In [59]:
df.drop(index=[2])

     name  age  Age city
0  ramesh   30   30  hyd
1  suresh   22   22  mum

In [61]:
df.drop([0,2])

     name  age  Age city
1  suresh   22   22  mum

**DROPCOLUMNDS**

In [64]:
df.columns

Index(['name', 'age', 'Age', 'city'], dtype='object')

In [68]:
df.columns[2]

'Age'

In [70]:
df.drop('Age',axis=1)

     name  age   city
0  ramesh   30    hyd
1  suresh   22    mum
2  mahesh   54  delhi

In [72]:
#df.column(2,axis=1)here 2 represts the rows axis 1 means 2 columnc that why i does not works we want to drop the column

In [94]:
#Different type to drop the rows
#df.drop('age') # pytho assume the age names is contain any row 
l1=df.drop('age',axis=1)
print(l1)
l2=df.drop(columns=['age'])
print(l2)
l3=df.drop(columns='city')
print(l3)
l4=df.drop(columns=['name','age'])
print(l4)

     name   city
0  ramesh    hyd
1  suresh    mum
2  mahesh  delhi
     name   city
0  ramesh    hyd
1  suresh    mum
2  mahesh  delhi
     name  age
0  ramesh   30
1  suresh   22
2  mahesh   54
    city
0    hyd
1    mum
2  delhi

In [80]:
df
df.drop(columns=['Age'],inplace=True)
df

     name  age   city
0  ramesh   30    hyd
1  suresh   22    mum
2  mahesh   54  delhi

**RENAME**

In [43]:
#Rename the columns and index
df.rename()

df.rename(
    mapper: 'Renamer | None' = None,
    *,
    index: 'Renamer | None' = None,
    columns: 'Renamer | None' = None,
    axis: 'Axis | None' = None,
    copy: 'bool | None' = None,
    inplace: 'bool' = False)
mapper means dictonary

SyntaxError: invalid syntax (4172907036.py, line 5)

In [45]:
df.columns
df

     name  age  Age   city
0  ramesh   30   30    hyd
1  suresh   22   22    mum
2  mahesh   54   54  delhi

In [59]:
dict1={'city':'City'}
df.rename(dict1,axis=1,inplace=True)
df

     name  age  Age   City
0  ramesh   30   30    hyd
1  suresh   22   22    mum
2  mahesh   54   54  delhi

In [57]:
df.rename(columns=dict1)

     name  age  Age   City
0  ramesh   30   30    hyd
1  suresh   22   22    mum
2  mahesh   54   54  delhi

**Step-8:Append the rows**

- we need to use **loc**

- df.loc[<row number>,<column name>

     - eg:df.loc[2,'city']

- multiple rows from multiple columns

    - eg :df.loc[[1,2],['names','city']
- df.loc[start:stop:step,<columnname>

   - eg:df.loc[0:3,'city']

df.loc<row><columnname>
df.iloc<row><column number>

In [61]:
df.iloc[2]#series

name    mahesh
age         54
Age         54
City     delhi
Name: 2, dtype: object

In [63]:
df.iloc[1,2]#dataframe

22

In [112]:
df.iloc[[1,2]]#multiple values we use list

     name  age   City
1  suresh   22    mum
2  mahesh   54  delhi

In [114]:
df.iloc[[2],[2]]

    City
2  delhi

In [116]:
df.iloc[[1,2],[0,2]]

     name   City
1  suresh    mum
2  mahesh  delhi

In [118]:
df.iloc[:,[2]]

    City
0    hyd
1    mum
2  delhi

In [120]:
df.loc[0:3]

     name  age   City
0  ramesh   30    hyd
1  suresh   22    mum
2  mahesh   54  delhi

In [122]:
df.loc[:]# dataframe i consist of list and i wil represents the list list(range(0,3))

     name  age   City
0  ramesh   30    hyd
1  suresh   22    mum
2  mahesh   54  delhi

In [126]:
df.loc[2,'City']

'delhi'

In [128]:
df.loc[[2],['City']]

    City
2  delhi

In [134]:
df.loc[[1,2],['City','name']]

    City    name
1    mum  suresh
2  delhi  mahesh

In [136]:
df.loc[:2,'City']

0      hyd
1      mum
2    delhi
Name: City, dtype: object

In [140]:
df.loc[:,['City']]#: repersents its already exists the list it will become as dataframe A

    City
0    hyd
1    mum
2  delhi

In [142]:
import pandas as pd
df=pd.DataFrame()
path1=r"http://localhost:8888/notebooks/Documents/EDA%20dataframes.ipynb?/employee.csv"
path2=r"employee.csv"
path3=r"http://localhost:8888/notebooks/Documents/EDA%20dataframes.ipynb?/employee.xlsx"
path4=r"employee.xlsx"
df.to_csv(path1,index=False)
df.to_csv(path2,index=False)
df.to_excel(path3,index=False)
df.to_excel(path4,index=False)
pd.read_excel(path3)

ValueError: Excel file format cannot be determined, you must specify an engine manually.